//--------------------------------------------------------------------------------------------------
//  Project : Disturbing Information
//  Edition : WioTerminal with Extend multi LCD-Monitor
//  File path : src/MyPanel/Utility/MyDrawScroll.h
//  Copyright 2019, 2020, 2021, 2022, 2023 - OperonTeam
//--------------------------------------------------------------------------------------------------
#ifndef MYDRAWSCROLL_H
#define MYDRAWSCROLL_H

//--------------------------------------------------------------------------------------------------
// 外部参照・依存関係インクルード・ヘッダ情報
//--------------------------------------------------------------------------------------------------
#include "LGFX/MyLGFX.h"													// LovyanGFX Wrapper

//--------------------------------------------------------------------------------------------------
// 情報表示パネル用基底クラス
//--------------------------------------------------------------------------------------------------
class   _MyDrawScroll {
	private:
		//------------------------------------------------------------------------------------------
		// 表示パネル・オブジェクト
		//------------------------------------------------------------------------------------------
		INT						iScrollMode;						// スクロールモード
		INT						iSystemDrawAreaScroll;				// メッセージスクロールカウンタ
		ULONG					ulDrawJARVisMessageTime;			// 前回描画時刻（millis）
		INT						iScrollW;
		INT						iScrollH;
		INT						iScrollX;
		INT						iScrollY;
		String					strScrollMessage;
//---
	public:
		//------------------------------------------------------------------------------------------
		// メインどころのメソッド
		//------------------------------------------------------------------------------------------
		_MyDrawScroll();
		~_MyDrawScroll();
//
		//	+-------------------+-------------------------------------------+
		// 	| システムステータス| ＪＡＲＶｉｓ情報							|
		// 	| [表示位置固定]	| [表示位置固定]							|
		// 	+-------------------+-------------------------------------------+
		//	| サイドパネル情報[Flexibility]					 				|
		//	|	・メイン	:PanelLayout	= Main	 						|
		//	|	・ブランク	:				= Blank	 						|
		//	|	・気象情報  :				= Weather						|
		//	|	・タイヤ情報:				= TPMS							|
		//	|	・ラップ計測:				= LapTimer						|
		// 	+---------------------------------------------------------------+
		enum	_PanelLayout {										// 描画レイアウト定数
			None		= -1,										//   初期値（初回のみ利用）
			Main		= 0,										// 　メイン・レイアウト
			Blank		= 1,										// 　ブランク・レイアウト
			Weather		= 2,										// 　気象情報・レイアウト
			TPMS		= 3,										// 　タイヤ推移・レイアウト
			LapTimer	= 4											// 　ラップライム・レイアウト  
		};

		//------------------------------------------------------------------------------------------
		// Ｓｐｒｉｔｅ描画　スクロール文字列描画メソッド
		//	SpriteDrawScrollStringInit		スクロールメッセージの初期化
		//	SpriteDrawScrollStringRun		メッセージのスクロール処理
		//	SpriteDrawSolidStringRun		メッセージ（固定）処理
		//------------------------------------------------------------------------------------------
		VOID					SpriteDrawScrollStringInit(INT iW, INT iH, INT iX, INT iY, String strMessage);
		BOOL					SpriteDrawScrollStringRun(_MyLGFX *pMyLGFX);
		BOOL					SpriteDrawSolidStringRun(_MyLGFX *pMyLGFX);
//---
		//------------------------------------------------------------------------------------------
		// 表示色
		//	GetSpeedColor					移動速度表示色
////	//	GetDevStatusColor				デバイスマーカー表示色
		//------------------------------------------------------------------------------------------
//		INT						GetSpeedColor(LONG lSpeed);
//		SHORT					GetDevStatusColor(_MyDEV_STAT MyFDELogID);
};
#endif
/*-- End Of File --*/
