//--------------------------------------------------------------------------------------------------
//  Project : Disturbing Information
//  Edition : WioTerminal with Extend multi LCD-Monitor
//  File path : src/MyPanel/MyPanel.h
//  Copyright 2019, 2020, 2021, 2022, 2023 - OperonTeam
//--------------------------------------------------------------------------------------------------
#ifndef MYPANEL_H
#define MYPANEL_H

//--------------------------------------------------------------------------------------------------
// 外部参照・依存関係インクルード・ヘッダ情報
//--------------------------------------------------------------------------------------------------
#include "LGFX/MyLGFX.h"													// LovyanGFX Wrapper
#include "PanelMain/MyPanelMain.h"											// Main
#include "PanelSide/MyPanelSide.h"											// Side

//--------------------------------------------------------------------------------------------------
// 情報表示用ＬＣＤクラス
//--------------------------------------------------------------------------------------------------
class   _MyPanel {
	private:
		//------------------------------------------------------------------------------------------
		// ＴＦＴサイドパネル管理クラス
		//------------------------------------------------------------------------------------------
		_MyLGFX				MyLGFXMain;
		_MyLGFX				MyLGFXSide;
		//---
		//------------------------------------------------------------------------------------------
		// ＴＦＴサイドパネル管理クラス
		//------------------------------------------------------------------------------------------
		_MyPanelMain		MyPanelMain;									// メインパネル描画クラス
		_MyPanelSide		MyPanelSide;									// サイドパネル描画クラス
//---
		LONG				lTFTSleepTime;									// パネル自動消灯時間

		//------------------------------------------------------------------------------------------
		// 表示レイアウト管理クラス
		//------------------------------------------------------------------------------------------
		enum	_DrawLayout {
			None				= 0,										// 初期状態
			MainArea			= 1,										// メインパネル（全体）	
			SideTopConsole		= 2,										// サイドパネル・上層領域（メッセージ）
			SideTopMarker		= 3,										// サイドパネル・上層領域（ステータス）
			SideLowArea			= 4,										// サイドパネル・下層領域
			AllBlank			= 5											// パネルブランク
		};
		_DrawLayout			DrawLayout;										// パネル描画エリア
//---
		//------------------------------------------------------------------------------------------
		//
		//------------------------------------------------------------------------------------------
		BOOL				bDrawInitFlag;									// 初期化フラグ
		ULONG				ulPanelChangedTime;								// 表示パネルレイアウト変更時間(=milles())
		BOOL				QueNextLayout(_MyDevice *pMyDevice, _DrawLayout DrawLayout);
//---
	public:
		//------------------------------------------------------------------------------------------
		// メインどころのメソッド
		//------------------------------------------------------------------------------------------
		_MyPanel();
		~_MyPanel();
		//
		INLINE	_MyLGFX *	TFTHandleMain(VOID) {							// TFTパネルハンドル（メイン）
								return	&this->MyLGFXMain;
		};
		INLINE	_MyLGFX *	TFTHandleSide(VOID) {							// TFTパネルハンドル（サイド）
								return	&this->MyLGFXSide;
		};
//---
		VOID				MyPanelUpdate(_MyDevice *pMyDevice, _MyJARVis *pMyJARVis);
//---
//---
//---
		VOID				Initialize(_MyDevice *pMyDevice);
		VOID				DrawBootsplash(_MyDevice *pMyDevice, _MyJARVis *pMyJARVis);
		BOOL				DrawPanel(_MyDevice *pMyDevice, _MyJARVis *pMyJARVis);
};
#endif
/*-- End Of File --*/
