//--------------------------------------------------------------------------------------------------
//  Project : Disturbing Information
//  Edition : WioTerminal with Extend multi LCD-Monitor
//  File path : src/MyTask/MyI2C/PAJ7620/MyPAJ7620.h
//  Copyright 2019, 2020, 2021, 2022, 2023 - OperonTeam
//--------------------------------------------------------------------------------------------------
#ifndef MYPAJ7620_H
#define MYPAJ7620_H

//--------------------------------------------------------------------------------------------------
// 外部参照・依存関係インクルード・ヘッダ情報
//--------------------------------------------------------------------------------------------------
#include <DFRobot_PAJ7620U2.h>

//--------------------------------------------------------------------------------------------------
// ジェスチャー・センサーデバイス用クラス
//--------------------------------------------------------------------------------------------------
class   _MyPAJ7620 : _MyI2CBase {
	protected:
		//------------------------------------------------------------------------------------------
		// ジェスチャー認識センサー(PAJ7620U2)
		//------------------------------------------------------------------------------------------
		DFRobot_PAJ7620U2		MySensor;							// PAJ7620

		//------------------------------------------------------------------------------------------
		// センサー情報の取り扱いメソッド
		//------------------------------------------------------------------------------------------
		VOID					MySensorBegin(_MyDevice *pMyDevice);
		VOID					MySensorUpdate(_MyDevice *pMyDevice);
		VOID					MySensorSetup(_MyDevice *pMyDevice);

	public:
		_MyPAJ7620();
		~_MyPAJ7620();
		//
		VOID					Begin(_MyDEV_ID MyDevID, UCHAR ucAddress, TwoWire *pTwoWire, _MyDevice *pMyDevice);
		VOID					Update(_MyDevice *pMyDevice);
};
#endif
/*-- End Of File --*/
