//--------------------------------------------------------------------------------------------------
//  Project : Disturbing Information
//  Edition : WioTerminal with Extend multi LCD-Monitor
//  File path : src/MyJARVis/PastRec/MyPastRec.h
//  Copyright 2019, 2020, 2021, 2022, 2023 - OperonTeam
//--------------------------------------------------------------------------------------------------
#ifndef MYPASTREC_H
#define MYPASTREC_H

//--------------------------------------------------------------------------------------------------
// _MyPastInfoRec管理用クラス
//	時系列グラフの描画用に少しだけ過去の情報を保存する
//--------------------------------------------------------------------------------------------------
class   _MyPastRec {
	private:
		//------------------------------------------------------------------------------------------
		// MyPastInfoRec情報
		//------------------------------------------------------------------------------------------
		FLOAT				fGPSSpeed;										// For FPS 		RMC	移動速度（km/h）
		FLOAT				fGPSCourse;										// 				RMC	進行方向
//---
	public:
		_MyPastRec();
		~_MyPastRec();
};
#endif
/*-- End Of File --*/
