//--------------------------------------------------------------------------------------------------
//  Project : Disturbing Information
//  Edition : WioTerminal with Extend multi LCD-Monitor
//  File path : src/MyTask/MyI2C/BME280/MyBME280.h
//  Copyright 2019, 2020, 2021, 2022, 2023 - OperonTeam
//--------------------------------------------------------------------------------------------------
#ifndef MYBME280_H
#define MYBME280_H

//--------------------------------------------------------------------------------------------------
// 外部参照・依存関係インクルード・ヘッダ情報
//--------------------------------------------------------------------------------------------------
#include <Adafruit_BME280.h>

//--------------------------------------------------------------------------------------------------
// Ｉ２Ｃデバイス用クラス
//--------------------------------------------------------------------------------------------------
class   _MyBME280 : _MyI2CBase {
	protected:
		//------------------------------------------------------------------------------------------
		// 気象情報（湿度・気圧センサー）(BME280)
		//------------------------------------------------------------------------------------------
		Adafruit_BME280			MySensor;

		//------------------------------------------------------------------------------------------
		// センサー情報の取り扱いメソッド
		//------------------------------------------------------------------------------------------
		VOID					MySensorBegin(_MyDevice *pMyDevice);
		VOID					MySensorUpdate(_MyDevice *pMyDevice);
		VOID					MySensorSetup(_MyDevice *pMyDevice);

	public:
		_MyBME280();
		~_MyBME280();
		//
		VOID					Begin(_MyDEV_ID MyDevID, UCHAR ucAddress, TwoWire *pTwoWire, _MyDevice *pMyDevice);
		VOID					Update(_MyDevice *pMyDevice);
};
#endif
/*-- End Of File --*/
